Ran Plan for 2 projects:

1. dir: `project2` workspace: `default`
1. dir: `project1` workspace: `default`

### 1. dir: `project2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm[0].google_compute_firewall.allowing-http has been deleted
- resource "google_compute_firewall" "allowing-http" {
      - creation_timestamp = "2025-06-30T02:25:09.797-07:00" -> null
      - destination_ranges = [] -> null
      - direction          = "INGRESS" -> null
      - disabled           = false -> null
      - id                 = "projects/stable-parsec-462607-h1/global/firewalls/allowing-http" -> null
      - name               = "allowing-http" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/networks/default" -> null
      - priority           = 1000 -> null
      - project            = "stable-parsec-462607-h1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/firewalls/allowing-http" -> null
      - source_ranges      = [
          - "0.0.0.0/0",
        ] -> null
      - target_tags        = [
          - "http-server",
        ] -> null

      - allow {
          - ports    = [
              - "80",
            ] -> null
          - protocol = "tcp" -> null
        }
    }
  # module.vm[0].google_compute_firewall.allowing-https has been deleted
- resource "google_compute_firewall" "allowing-https" {
      - creation_timestamp = "2025-06-30T02:25:09.806-07:00" -> null
      - destination_ranges = [] -> null
      - direction          = "INGRESS" -> null
      - disabled           = false -> null
      - id                 = "projects/stable-parsec-462607-h1/global/firewalls/allowing-https" -> null
      - name               = "allowing-https" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/networks/default" -> null
      - priority           = 1000 -> null
      - project            = "stable-parsec-462607-h1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/firewalls/allowing-https" -> null
      - source_ranges      = [
          - "0.0.0.0/0",
        ] -> null
      - target_tags        = [
          - "https-server",
        ] -> null

      - allow {
          - ports    = [
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }
  # module.vm[0].google_compute_instance.vm_instance has been changed
~ resource "google_compute_instance" "vm_instance" {
        id                   = "projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2"
      + labels               = {}
      + metadata             = {}
        name                 = "terraform-instance-project2"
      + resource_policies    = []
        tags                 = [
            "http-server",
            "https-server",
        ]
        # (16 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vm[0].google_compute_firewall.allowing-http will be created
+ resource "google_compute_firewall" "allowing-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-http"
      + network            = "default"
      + priority           = 1000
      + project            = "stable-parsec-462607-h1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "http-server",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # module.vm[0].google_compute_firewall.allowing-https will be created
+ resource "google_compute_firewall" "allowing-https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-https"
      + network            = "default"
      + priority           = 1000
      + project            = "stable-parsec-462607-h1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "https-server",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e6dfe01407c6:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project2`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `project1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket1" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket1" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket1" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:53:02.520Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:53:02.520Z" -> null
      - url                         = "gs://bucket-geeta13-bucket1" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:53:02.520Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }
  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket3" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket3" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket3" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:53:02.506Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:53:02.506Z" -> null
      - url                         = "gs://bucket-geeta13-bucket3" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:53:02.506Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket3"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e6dfe01407c6:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project1`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
